# coding: utf8

import random
import os

proseuxi = ['Κύριε Ιησού Χριστέ, ελέησον με', 'Δόξα σοι ὁ Θεός']
#proseuxi = ['Κύριε Ιησού Χριστέ, ελέησον με', 'Δόξα σοι ὁ Θεός','Κύριε ἡμῶν Ἰησοῦ Χριστέ, Υἱέ τοῦ Θεοῦ, ἐλέησόν με τόν ἁμαρτωλόν','Μνήσθητί μου, Κύριε, ὅταν ἔλθῃς ἐν τῇ βασιλείᾳ σου','Ἁγία Τριάς ὁ Θεός, ἐλέησον καί σῶσον ἡμᾶς','Μέγα τό Ὄνομα τῆς Ἁγίας Τριάδος','Ὑπεραγία Θεοτόκε, πρέσβευε ὑπέρ ἡμῶν','Ταῖς πρεσβείαις τῆς Θεοτόκου, Σῶτερ, σῶσον ἡμᾶς','Σταυρέ τοῦ Χριστοῦ πανσεβάσμιε, σῶσον ἡμᾶς τῇ δυνάμει Σου','Πᾶσαι αἱ οὐράνιαι δυνάμεις τῶν ἁγίων Ἀγγέλων καί Ἀρχαγγέλων, πρεσβεύσατε ὑπέρ ἡμῶν','Απόστολοι τοῦ Χριστοῦ καί πάντες Ἅγιοι, πρεσβεύσατε ὑπέρ ἡμῶν','Παναγία Τριάς φώτισον ἡμᾶς τί δεῖ ἡμᾶς ποιεῖν καί λέγειν','Δόξα σοι ὁ Θεός ἡμῶν, δόξα σοι','Ὁ Θεός, ἱλάσθητί μοι, τῷ ἁμαρτωλῷ, καί ἐλέησόν με','Ἐλέησόν με, ὁ Θεός, ἐλέησόν με κατά τό μέγα ἔλεός Σου','Ο Θεός ανάπαυσον τας ψυχάς των κεκοιμημενων δουλων σου','Ὑπερένδοξε, ἀειπάρθενε, εὐλογημένη Θεοτόκε, προσάγαγε τήν ἡμετέραν προσευχήν, τῷ Υἱῷ σου καί Θεῷ ἡμῶν, καί αἴτησαι, ἵνα σώσῃ διά σοῦ τάς ψυχάς ἡμῶν']
#print(random.choice(proseuxi))

#dataset = random.randint(1000000000,9999999999)
#os.mkdir("datasets/" + str(dataset))

generated = random.randint(1000000000,9999999999)

for x in range(25000000):
    sentence = random.choice(proseuxi)

    f = open("generated/" + str(generated) + ".txt", "a")
    f.write(sentence + "\n")
    f.close()
